tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
# tap "mongodb/brew"
brew "ansible"
brew "bat"
brew "coreutils"
brew "devcontainer"
brew "exiftool"
brew "ffmpeg"
brew "gcc"
brew "gh"
brew "git"
brew "gnu-tar"
brew "gnupg"
brew "go"
brew "gpg2"
brew "graphviz"
brew "grep"
# brew "helm"
brew "htop"
brew "inetutils"
# https://stackoverflow.com/a/62623099/2411224
brew "java"
# brew "jabba"
# brew "jenv"
brew "jq"
# brew "kotlin"
# brew "librdkafka"
brew "libtool"
brew "libusb"
brew "mas"
brew "nmap"
# brew "node"
# brew "openjdk"
# brew "paperkey"
brew "p7zip"
brew "pandoc"
# brew "pkl"
brew "plantuml"
brew "pinentry"
brew "pipenv"
brew "pipx"
brew "pre-commit"
# brew "podman"
brew "pyenv"
brew "scroll-reverser"
brew "stats"
brew "subversion"
brew "svn" # required for fonts
brew "texlive"
brew "tmux"
brew "tmuxinator"
brew "trash"
brew "tree"
brew "watch"
brew "wget"
# An additional Python package dependency may need to be installed to use ykman - pip install yubikey-manager
brew "ykman"
brew "yubikey-personalization"
brew "yq"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
cask "alfred"
# cask "basictex"
cask "caffeine"
# cask "discord"
cask "docker"
cask "firefox"
cask "flux"
cask "font-lato"
cask "font-noto-emoji"
cask "font-noto-mono"
cask "font-noto-sans"
cask "font-noto-serif"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-source-sans-3"
cask "font-source-serif-4"
# cask "google-chrome"
# cask "google-chrome-canary"
# cask "google-cloud-sdk"
cask "google-earth-pro"
cask "intellij-idea-ce"
cask "iterm2"
# cask "java"
# cask "mactex-no-gui"
# cask "microsoft-edge"
cask "obsidian"
# cask "postman"
# cask "pycharm"
cask "pycharm-ce"
# cask "qlmarkdown" # https://developer.apple.com/design/human-interface-guidelines/macos/system-capabilities/quick-look/
# cask "qlvideo"
# cask "quicklook-json"
cask "rectangle"
# cask "slack"
cask "speedcrunch"
cask "spotify"
cask "sublime-text"
# cask "tor-browser"
cask "veracrypt"
# cask "virtualbox"
# cask "vlc"
cask "windows-app"
# cask "webstorm"
cask "yubico-yubikey-manager"
# cask "zoom"
